open-source-whitepaper/modernizing.org
#+TITLE:  Ensuring Center for Army Analysis Compliance with the Federal Source Code Policy
#+SUBTITLE: Working Paper
#+AUTHOR: Tom Spoon, Rick Hanson and Craig Flewelling
#+DATE: 3 March 2017
#+VERSION: 1.2
#+STARTUP: showall
#+LANGUAGE: en
#+OPTIONS: ':t toc:nil
# #+LATEX_CLASS: amsart 
#+LATEX_CLASS_OPTIONS: [letterpaper,10pt]
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \setlist[itemize,1]{leftmargin=*,topsep=0.5em,itemsep=0.5em}
#+LATEX_HEADER: \setlist[itemize,2,3]{leftmargin=*,topsep=0.5em,itemsep=0.5em}
#+LATEX_HEADER: \setlist[enumerate,1]{leftmargin=*,topsep=0.5em}
#+HTML_HEAD: <style>ul li{margin-top:0.5em}ol li{margin-top:0.5em}</style>
#+LATEX_HEADER: \parindent=0em
#+LATEX_HEADER: \parskip=1em
#+LATEX_HEADER: \textwidth=6.5truein
#+LATEX_HEADER: \oddsidemargin=0.0truein
#+LATEX_HEADER: \evensidemargin=0.0truein
#+LATEX_HEADER: \topmargin=-0.6truein
#+LATEX_HEADER: \textheight=9truein
#+LATEX_HEADER: \hyphenation{MAR-A-THON}
#+LATEX_HEADER: \hypersetup{colorlinks,citecolor=black, filecolor=black, linkcolor=blue, urlcolor=black}
# Put quotes in italics, so we don't have to quote them.
#+HTML_HEAD: <style>blockquote{font-style: italic;}</style>
# Source of hack below: http://tex.stackexchange.com/questions/47306/change-the-font-of-the-block-quote
#+LATEX_HEADER: \usepackage{etoolbox}
#+LATEX_HEADER: \AtBeginEnvironment{quote}{\itshape\parskip=0em\leftmargini=1em}
#+LATEX_HEADER: \usepackage{draftwatermark}
#+LATEX_HEADER: \SetWatermarkText{\textbf{DRAFT}}
#+LATEX_HEADER: \SetWatermarkScale{5}
#+LATEX_HEADER: \SetWatermarkColor[gray]{0.9}
#+HTML_HEAD: <style>.abstract {margin-top:2em;margin-left:auto;margin-right:auto;width:80%;font-size:85%}
#+HTML_HEAD:        .abstract > p {display:inline;}</style>

#+HTML: <div class="abstract"><b>Abstract.</b>
#+LATEX: \begin{abstract}\noindent
The Center for Army Analysis (CAA) should re-align its policy for the 
creation and releasability of Open Source Software (OSS), with the current 
federal policy mandated by Executive Order and detailed by  the Federal
Source Code Policy (FSCP).  This re-alignment will take CAA (and other agencies)
from the 1950s "communication channels of inability", and the mistrust
which follows from that, to the modern era of facilitating communication,
sharing technology, and collaboration.  As the Office of the President of 
the United States notes, this will accrue manifold benefits across the federal 
government and, when warranted, with the public. Time and again, engagement 
across both communities --- such as in the development and maintenance of 
Open Source Software and the collaborative work enabled by internet discussion 
boards and (pre-web) newsgroups --- successfully brought vast, previously 
untapped technical resources to bear to solve complicated problems.
#+LATEX: \end{abstract}
#+HTML: </div><!-- end Abstract -->


* Background

Like many government agencies, the Center for Army Analysis (CAA) is both a consumer and producer of software.
From decades-old legacy models and simulations that support Army and Department of Defense analyses, to the
utilities, scripts, and tools of today that enable rapid research, analysis, and improved productivity, the federal
employees at CAA have created a bevy of source code.

CAA's default position regarding sharing these creative works,
particularly in the realm of modeling and simulation source, is one of closed-source and isolation.  Objections to releasing
source code range from security and classification risks, to loss of a competitive analytic edge, to lacking indemnity from
potential consumers of CAA software, to the simple absence of a mandate to share.  These concerns are more or less codified in 
the prevailing Army Modeling and Simulation Office (AMSO) releasability policy in AR 5-11 (2014), which fundamentally 
leaves the decision to share source code to CAA.  Until recently, CAA's default position has been supported by 
legacy policy that defers to the preference of CAA leadership rather than mandating sharing and openness.

This becomes problematic when considering the overall benefits accrued
to the government and the American public --- that have been
identified by the Executive Branch and formalized into policy --- for
/openness and sharing/, the exact opposite operating procedures of the
legacy one of /closedness and isolation/ maintained at some lower echelons.  
Also problematic is when agencies leverage the technology of open source 
(implying, mutually shared), meanwhile ironically, and to our eventual detriment, 
refusing to share the advancements they made upon them (when national security concerns
are not involved).

* Problem

Unfortunately CAA's position, and the policy in AR 5-11, is not compliant with current policy, namely the Federal Source Code Policy as directed by
Executive Order and subsequent Office of Management and Budget, Executive Office of the President (OMB) policy.  
Initiated by President Obama, and continued by President Trump, the default position of the federal
government towards source code is openness.  This position emerged in 2013 under Executive Order No. 13642,
"Making Open and Machine Readable the New Default for Government Information" (EO 13642). Via EO 13642, the Obama administration mandated sharing 
government data --- including source code --- between federal agencies, and embraced open-sourcing federal software to spur 
cost-reduction, reduce redundancy, and place tax-payer funded works in the public domain.

EO13642 authorized and directed the OMB to define and implement the federal policy to execute the order, which 
OMB detailed under the Digital Government Initiative (a.k.a. "The People's Code") in August of 2016.  The ultimate 
result emerged in OMB M-16-21, "Federal Source Code Policy Memorandum," when the detailed Federal Source Code Policy 
(FSCP) became the governing policy for all federal agencies.  Since the policy's inception, marked by the 2016 rollout of 
the central coordinating repository of government code https://code.gov, CAA has not been compliant with the 
mandates of the FSCP and the federal government's modernized policy on sharing and Open Source Software(OSS).  

* Paradigm Shift in Software Development: Embracing Open Source 
DoD has been an early-adopter and general proponent of the utility of Open Source Software.
The DoD Chief Information Officer (DoD-CIO/G6) paved the way for broad adoption and use of superior 
Open Source tools on DoD networks with its 2009 policy, "DoD-CIO/G6 Clarification Guidance Regarding 
Open Source Software (OSS)".  In conjunction with the memorandum, DoD/CIO-G6 provided an official
website addressing the benefits, risks, legalities, and practical questions surrounding the use of
Open Source Software on DoD networks (http://dodcio.defense.gov/Open-Source-Software-FAQ/).

In many ways, the policy and the website were merely addressing the reality of prevalent usage
of OSS throughout DoD.  Case in point: CAA initiated and maintains exceptions to 
Army policy for internal networks specifically to leverage the superior capability of both closed 
and Open Source Software that may not have a Certificate of Networthiness, or otherwise be "approved" 
software.  Even legacy CAA models and simulations rely heavily on Open Source Software for 
development, scripting, and processing (both pre and post).

Still, the DoD/CIO-G6 policy focuses on access and use of Open Source Software, rather than
on sharing existing federal source code or releasing source code into the public domain.
Notably, the Army CIO/G6 has no additional policy addressing either the use or release of 
open source software.  Until the emergence of the Federal Source Code Policy, DoD agencies
had the ability to use Open Source Software for mission execution, without the mandate to
share or otherwise release source code.
  
