open-source-whitepaper/modernizing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-05 Sun 16:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Ensuring Center for Army Analysis Compliance with the Federal Source Code Policy</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Tom Spoon, Rick Hanson and Craig Flewelling" />
</head>
<body>
<div id="content">
<h1 class="title">Ensuring Center for Army Analysis Compliance with the Federal Source Code Policy
<br>
<span class="subtitle">Working Paper</span>
</h1>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
The Center for Army Analysis (CAA) should re-align its policy for the 
creation and releasability of Open Source Software (OSS), with the current 
federal policy mandated by Executive Order and detailed by  the Federal
Source Code Policy (FSCP).  This re-alignment will take CAA (and other agencies)
from the 1950s &ldquo;communication channels of inability&rdquo;, and the mistrust
which follows from that, to the modern era of facilitating communication,
sharing technology, and collaboration.  As the Office of the President of 
the United States notes, this will accrue manifold benefits across the federal 
government and, when warranted, with the public. Time and again, engagement 
across both communities &#x2014; such as in the development and maintenance of 
Open Source Software and the collaborative work enabled by internet discussion 
boards and (pre-web) newsgroups &#x2014; successfully brought vast, previously 
untapped technical resources to bear to solve complicated problems.
</p>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Background</h2>
<div class="outline-text-2" id="text-2">
<p>
Like many government agencies, the Center for Army Analysis (CAA) is both a consumer and producer of software.
From decades-old legacy models and simulations that support Army and Department of Defense analyses, to the
utilities, scripts, and tools of today that enable rapid research, analysis, and improved productivity, the federal
employees at CAA have created a bevy of source code.
</p>

<p>
CAA&rsquo;s default position regarding sharing these creative works,
particularly in the realm of modeling and simulation source, is one of closed-source and isolation.  Objections to releasing
source code range from security and classification risks, to loss of a competitive analytic edge, to lacking indemnity from
potential consumers of CAA software, to the simple absence of a mandate to share.  These concerns are more or less codified in 
the prevailing Army Modeling and Simulation Office (AMSO) releasability policy in AR 5-11 (2014), which fundamentally 
leaves the decision to share source code to CAA.  Until recently, CAA&rsquo;s default position has been supported by 
legacy policy that defers to the preference of CAA leadership rather than mandating sharing and openness.
</p>

<p>
This becomes problematic when considering the overall benefits accrued
to the government and the American public &#x2014; that have been
identified by the Executive Branch and formalized into policy &#x2014; for
<i>openness and sharing</i>, the exact opposite operating procedures of the
legacy one of <i>closedness and isolation</i> maintained at some lower echelons.  
Also problematic is when agencies leverage the technology of open source 
(implying, mutually shared), meanwhile ironically, and to our eventual detriment, 
refusing to share the advancements they made upon them (when national security concerns
are not involved).
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Problem</h2>
<div class="outline-text-2" id="text-3">
<p>
Unfortunately CAA&rsquo;s position, and the policy in AR 5-11, is not compliant with current policy, namely the Federal Source Code Policy as directed by
Executive Order and subsequent Office of Management and Budget, Executive Office of the President (OMB) policy.  
Initiated by President Obama, and continued by President Trump, the default position of the federal
government towards source code is openness.  This position emerged in 2013 under Executive Order No. 13642,
&ldquo;Making Open and Machine Readable the New Default for Government Information&rdquo; (EO 13642). Via EO 13642, the Obama administration mandated sharing 
government data &#x2014; including source code &#x2014; between federal agencies, and embraced open-sourcing federal software to spur 
cost-reduction, reduce redundancy, and place tax-payer funded works in the public domain.
</p>

<p>
EO13642 authorized and directed the OMB to define and implement the federal policy to execute the order, which 
OMB detailed under the Digital Government Initiative (a.k.a. &ldquo;The People&rsquo;s Code&rdquo;) in August of 2016.  The ultimate 
result emerged in OMB M-16-21, &ldquo;Federal Source Code Policy Memorandum,&rdquo; when the detailed Federal Source Code Policy 
(FSCP) became the governing policy for all federal agencies.  Since the policy&rsquo;s inception, marked by the 2016 rollout of 
the central coordinating repository of government code <a href="https://code.gov">https://code.gov</a>, CAA has not been compliant with the 
mandates of the FSCP and the federal government&rsquo;s modernized policy on sharing and Open Source Software(OSS).  
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Paradigm Shift in Software Development: Embracing Open Source</h2>
<div class="outline-text-2" id="text-4">
<p>
DoD has been an early-adopter and general proponent of the utility of Open Source Software.
The DoD Chief Information Officer (DoD-CIO/G6) paved the way for broad adoption and use of superior 
Open Source tools on DoD networks with its 2009 policy, &ldquo;DoD-CIO/G6 Clarification Guidance Regarding 
Open Source Software (OSS)&rdquo;.  In conjunction with the memorandum, DoD/CIO-G6 provided an official
website addressing the benefits, risks, legalities, and practical questions surrounding the use of
Open Source Software on DoD networks (<a href="http://dodcio.defense.gov/Open-Source-Software-FAQ/">http://dodcio.defense.gov/Open-Source-Software-FAQ/</a>).
</p>

<p>
In many ways, the policy and the website were merely addressing the reality of prevalent usage
of OSS throughout DoD.  Case in point: CAA initiated and maintains exceptions to 
Army policy for internal networks specifically to leverage the superior capability of both closed 
and Open Source Software that may not have a Certificate of Networthiness, or otherwise be &ldquo;approved&rdquo; 
software.  Even legacy CAA models and simulations rely heavily on Open Source Software for 
development, scripting, and processing (both pre and post).
</p>

<p>
Still, the DoD/CIO-G6 policy focuses on access and use of Open Source Software, rather than
on sharing existing federal source code or releasing source code into the public domain.
Notably, the Army CIO/G6 has no additional policy addressing either the use or release of 
open source software.  Until the emergence of the Federal Source Code Policy, DoD agencies
had the ability to use Open Source Software for mission execution, without the mandate to
share or otherwise release source code.
</p>
</div>
</div>
