open-source-whitepaper/modernizing.org
* Benefits of Open Source and Sharing
Open Source Software fundamentally rests on the idea that the open sharing of information 
yields numerous second and third order benefits.  In the case of software, making the 
source code available promotes the following principles.

- Publication
  - Particularly in the case of reproducible research, releasing the source code is a 
    modern pre-requisite to validate any scientific or academic observations.  
  - Similarly, making even amateur or experimental source code available serves as an 
    entry point for establishing communication with other interested parties that 
    may form a community.
- Collaboration
  - Freedom of information fosters communication, allowing interested parties to collaborate 
    across various domains including research, development, issue tracking, patching source code, and more.
- Reuse
  - The "community" can freely build upon and extend existing works, ideally bypassing 
    the need to constantly reinvent the wheel or duplicate effort.
  - Much like academia and industry, reusable source code allows the state of the art 
    to advance more rapidly.

According to DoD  (DoD/CIO-G6 Clarifying Guidance on Open Source Software, p. 4-5),

#+LATEX: \begingroup
#+BEGIN_QUOTE
#+LATEX: \parindent=0em
(i) The continuous and broad peer-review enabled by publicly available
source code supports software reliability and security efforts through
the identification and elimination of defects that might otherwise go
unrecognized by a more limited core development team.

(ii) The unrestricted ability to modify software source code enables
the Department to respond more rapidly to changing situations,
missions, and future threats.

(iii) Reliance on a particular software developer or vendor due to
proprietary restrictions may be reduced by the use of OSS, which can
be operated and maintained by multiple vendors, thus reducing barriers
to entry and exit.

(iv) Open source licenses do not restrict who can use the software or
the fields of endeavor in which the software can be used.  Therefore,
OSS provides a net-centric licensing model that enables rapid
provisioning of both known and unanticipated users.

(v) Since OSS typically does not have a per-seat licensing cost, it
can provide a cost advantage in situations where many copies of the
software may be required, and can mitigate risk of cost growth due to
licensing in situations where the total number of users may not be
known in advance.

(vi) By sharing the responsibility for maintenance of OSS with other
users, the Department can benefit by reducing the total cost of
ownership for software, particularly compared with software for which
the Department has sole responsibility for maintenance (e.g., GOTS).

(vii) OSS is particularly suitable for rapid prototyping and
experimentation, where the ability to “test drive” the software with
minimal costs and administrative delays can be important.
#+END_QUOTE
#+LATEX: \endgroup

Open Source Software has had such undeniable success that even historically closed-source,
proprietary companies like Microsoft have been making significant investments in opening their 
infrastructure and significantly contributing to the Open Source community, including helping 
historical "threats" like the Linux operating system.

* OMB M-16-21, "Federal Source Code Policy Memorandum" 
As a consequence of EO 13642, the OMB established the Federal Source Code Policy via memorandum 
M-16-21.  The Federal Source Code Policy prescribes mandatory requirements for federal agency 
practices for sharing source code, open-sourcing software, and participating in the Open Source 
Software community.

** Provisions

Major provisions of the FSCP include the following.

*** Government-wide Source Code Sharing
  At a minimum, government agencies are mandated to make source code available to the federal government 
  for interagency reuse.

*** Open Source Software Pilot Program
  - Government agencies (including DoD) are automatically part of a 3-year Open Source Pilot Program.
    During the pilot program, policy mandates that 20% of newly created custom software is to be open source.
    This applies to software created by government employees, and software created in execution of a 
    government contract.

  - Open-sourcing software is highly encouraged, and even temporarily mandated for a portion of 
    our new custom software projects for the duration of the pilot program.  Open source 
    software is intended to be broadly accessible, and developed with "open" practices, disseminated 
    on --- possibly 3rd party --- platforms with established open source communities.

*** code.gov
  Per the policy, agencies will coordinate and publicize their software with the OMB-managed 
  website https://code.gov .  This website serves as an accessible repository of all known 
  government source code, to facilitate discovery and ease reuse.
  
