open-source-whitepaper/modernizing.org
** Participation

The FSCP encourages participation in the OSS community.  Here is the
relevant excerpt taken from the FSCP memorandum, pp. 8-10.

#+BEGIN_QUOTE
When agencies release custom-developed source code as OSS to the public, they should develop and release 
the code in a manner that 
  (1) fosters communities around shared challenges, 
  (2) improves the ability of the OSS community to provide feedback on, and make contributions to, the source code, and 
  (3) encourages Federal employees and contractors to contribute back to the broader OSS community by making
      contributions to existing OSS projects.
In furtherance of this strategy, agencies should comply with the following principles:
- Leverage Existing Communities: 
    - Whenever possible, teams releasing custom-developed code to the public as OSS should appropriately engage and
      coordinate with existing communities relevant to the project. Government agencies should only develop their own  
      communities when existing communities do not satisfy their needs.
- Engage in Open Development: 
  - Software that is custom-developed for or by agencies should, to the extent possible and appropriate, be developed using
    open development practices. These practices provide an environment in which OSS can flourish and be repurposed. This principle,
    as well as the one below for releasing source code, include distributing a minimum viable product as OSS; engaging the public 
    before official release; and drawing upon the public’s knowledge to make improvements to the project.
- Adopt a Regular Release Schedule: 
  - In instances where software cannot be developed using open development practices, but is otherwise appropriate for 
    release to the public, agencies should establish an incremental release schedule to make the source code and associated 
    documentation available for public use.
- Engage with the Community: 
  - Similar to the requirement in the Administration’s Open Data Policy, agencies should create a process to engage in two-way 
    communication with users and contributors to solicit help in prioritizing the release of source code and feedback on the agencies’
    engagement with the community.
- Consider Code Contributions: 
  - One of the potential benefits of OSS lies within the communities that grow around OSS projects, whereby any party can contribute new code,
    modify existing code, or make other suggestions to improve the software throughout the software development lifecycle. 
    Communities help monitor changes to code, track potential errors and flaws in code, and other related activities. 
    These kinds of contributions should be anticipated and, where appropriate, considered for integration into
    custom-developed government software or associated materials.
- Documentation: 
  - It is important to provide OSS users and contributors with adequate documentation of source code in an effort to
    facilitate use and adoption. Agencies must ensure that their repositories include enough information to allow reuse
    and participation by third parties. In participating in community-maintained repositories, agencies should follow community  
    documentation standards. 
  - At a minimum, OSS repositories maintained by agencies must include the following information:
     - Status of software (e.g., prototype, alpha, beta, release, etc.);
     - Intended purpose of software;
     - Expected engagement level (i.e., how frequently the community can expect agency activity);
     - License details; and
    - Any other relevant technical details on how to build, make, install, or use the software, including dependencies (if applicable).
#+END_QUOTE
** Exceptions
    The FSCP acknowledges exceptions to policy where legislation, or national security precludes 
    the release of source code.  If source code is either classified, or classified as a "national 
    security system" under 44 U.S. Code § 3542, the software is excepted.

** Management and Oversight
DoD (and Army) CIO(s) are required to coordinate with the OMB CIO to define and execute 
an implementation plan for the OMB guidance.  OMB provides quarterly processes that 
oversee the growth, maintenance, and overall progress of both the pilot program and 
compliance with the Federal Source Code Policy.

* AR 5-11 "Management of Army Modeling and Simulation, 30 May 2014"
AR 5-11 is problematic for a number of reasons. First, there is no mention (specifically 
nothing precluding) distribution of models and simulations as Open Source Software.  Further, 
the distribution processes defined by the AR, specifically for interagency --- even internal 
Army distribution --- seems to directly contradict both the Executive Order and the OMB 
implementation memorandum.  Further, none of the regulations referenced in AR 5-11 address
the possibility of Open Source Software --- or even acknowledge it per se --- nor do they
address the legal and regulatory issues and mandates regarding OSS in the executive directives 
specified by the EO and the OMB memorandum. In general, AR 5-11 should be refreshed and/or 
rewritten to account for the FSCP and to clean up antiquated terminology.

* Forcing Functions
There is, at a minimum, a federal mandate for sharing source code across the government, and 
a mandate to open-source 20% of our custom code during the course of the 3-year Open Source Pilot 
Program. Under the Federal Source Code Policy, CAA must share our source in an open, unimpeded manner
with other government agencies so that there is government-wide reuse and cost saving.

Some agencies, such as NASA and the US Army Research Laboratories, are choosing to cut to the chase, 
and both open source and openly develop their code on GitHub. GitHub is the largest 3rd-party open source
community that offers source code hosting services, and meets every prescription of the FSCP guidance
for "Participation in the Open Source Community." GitHub repositories are then registered with 
https://code.gov to satisfy the discoverability and coordination requirements in the FSCP.

* Toward Open Sourcing MARATHON 4
MARATHON 4 is written in an open source language (Clojure), managed with open source 
tools (Git), and has emphasized unclassified development from inception.  MARATHON 4 
is intentionally written and maintained in such a way as to facilitate sharing and 
discovery, particularly to enable flexible development among remote work locations 
and to enable sharing of code for research purposes, peer-review, external verification,
and publication in professional forums like MORS, WinterSim, and INFORMS.  
MARATHON 4 is, for all intents and purposes, open-source ready and entirely compliant 
with the practices established by the FSCP.  Consequently, MARATHON 4 is an obvious 
open source release candidate, preferably hosted on GitHub.

