open-source-whitepaper/modernizing.html

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">6.2</span> Participation</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The FSCP encourages participation in the OSS community.  Here is the
relevant excerpt taken from the FSCP memorandum, pp. 8-10.
</p>

<blockquote>
<p>
When agencies release custom-developed source code as OSS to the public, they should develop and release 
the code in a manner that 
  (1) fosters communities around shared challenges, 
  (2) improves the ability of the OSS community to provide feedback on, and make contributions to, the source code, and 
  (3) encourages Federal employees and contractors to contribute back to the broader OSS community by making
      contributions to existing OSS projects.
In furtherance of this strategy, agencies should comply with the following principles:
</p>
<ul class="org-ul">
<li>Leverage Existing Communities: 
<ul class="org-ul">
<li>Whenever possible, teams releasing custom-developed code to the public as OSS should appropriately engage and
coordinate with existing communities relevant to the project. Government agencies should only develop their own  
communities when existing communities do not satisfy their needs.</li>
</ul></li>
<li>Engage in Open Development: 
<ul class="org-ul">
<li>Software that is custom-developed for or by agencies should, to the extent possible and appropriate, be developed using
open development practices. These practices provide an environment in which OSS can flourish and be repurposed. This principle,
as well as the one below for releasing source code, include distributing a minimum viable product as OSS; engaging the public 
before official release; and drawing upon the public’s knowledge to make improvements to the project.</li>
</ul></li>
<li>Adopt a Regular Release Schedule: 
<ul class="org-ul">
<li>In instances where software cannot be developed using open development practices, but is otherwise appropriate for 
release to the public, agencies should establish an incremental release schedule to make the source code and associated 
documentation available for public use.</li>
</ul></li>
<li>Engage with the Community: 
<ul class="org-ul">
<li>Similar to the requirement in the Administration’s Open Data Policy, agencies should create a process to engage in two-way 
communication with users and contributors to solicit help in prioritizing the release of source code and feedback on the agencies’
engagement with the community.</li>
</ul></li>
<li>Consider Code Contributions: 
<ul class="org-ul">
<li>One of the potential benefits of OSS lies within the communities that grow around OSS projects, whereby any party can contribute new code,
modify existing code, or make other suggestions to improve the software throughout the software development lifecycle. 
Communities help monitor changes to code, track potential errors and flaws in code, and other related activities. 
These kinds of contributions should be anticipated and, where appropriate, considered for integration into
custom-developed government software or associated materials.</li>
</ul></li>
<li>Documentation: 
<ul class="org-ul">
<li>It is important to provide OSS users and contributors with adequate documentation of source code in an effort to
facilitate use and adoption. Agencies must ensure that their repositories include enough information to allow reuse
and participation by third parties. In participating in community-maintained repositories, agencies should follow community  
documentation standards.</li>
<li><p>
At a minimum, OSS repositories maintained by agencies must include the following information:
</p>
<ul class="org-ul">
<li>Status of software (e.g., prototype, alpha, beta, release, etc.);</li>
<li>Intended purpose of software;</li>
<li>Expected engagement level (i.e., how frequently the community can expect agency activity);</li>
<li>License details; and</li>
</ul>
<ul class="org-ul">
<li>Any other relevant technical details on how to build, make, install, or use the software, including dependencies (if applicable).</li>
</ul></li>
</ul></li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">6.3</span> Exceptions</h3>
<div class="outline-text-3" id="text-6-3">
<p>
The FSCP acknowledges exceptions to policy where legislation, or national security precludes 
the release of source code.  If source code is either classified, or classified as a &ldquo;national 
security system&rdquo; under 44 U.S. Code § 3542, the software is excepted.
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">6.4</span> Management and Oversight</h3>
<div class="outline-text-3" id="text-6-4">
<p>
DoD (and Army) CIO(s) are required to coordinate with the OMB CIO to define and execute 
an implementation plan for the OMB guidance.  OMB provides quarterly processes that 
oversee the growth, maintenance, and overall progress of both the pilot program and 
compliance with the Federal Source Code Policy.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">7</span> AR 5-11 &ldquo;Management of Army Modeling and Simulation, 30 May 2014&rdquo;</h2>
<div class="outline-text-2" id="text-7">
<p>
AR 5-11 is problematic for a number of reasons. First, there is no mention (specifically 
nothing precluding) distribution of models and simulations as Open Source Software.  Further, 
the distribution processes defined by the AR, specifically for interagency &#x2014; even internal 
Army distribution &#x2014; seems to directly contradict both the Executive Order and the OMB 
implementation memorandum.  Further, none of the regulations referenced in AR 5-11 address
the possibility of Open Source Software &#x2014; or even acknowledge it per se &#x2014; nor do they
address the legal and regulatory issues and mandates regarding OSS in the executive directives 
specified by the EO and the OMB memorandum. In general, AR 5-11 should be refreshed and/or 
rewritten to account for the FSCP and to clean up antiquated terminology.
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">8</span> Forcing Functions</h2>
<div class="outline-text-2" id="text-8">
<p>
There is, at a minimum, a federal mandate for sharing source code across the government, and 
a mandate to open-source 20% of our custom code during the course of the 3-year Open Source Pilot 
Program. Under the Federal Source Code Policy, CAA must share our source in an open, unimpeded manner
with other government agencies so that there is government-wide reuse and cost saving.
</p>

<p>
Some agencies, such as NASA and the US Army Research Laboratories, are choosing to cut to the chase, 
and both open source and openly develop their code on GitHub. GitHub is the largest 3rd-party open source
community that offers source code hosting services, and meets every prescription of the FSCP guidance
for &ldquo;Participation in the Open Source Community.&rdquo; GitHub repositories are then registered with 
<a href="https://code.gov">https://code.gov</a> to satisfy the discoverability and coordination requirements in the FSCP.
</p>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">9</span> Toward Open Sourcing MARATHON 4</h2>
<div class="outline-text-2" id="text-9">
<p>
MARATHON 4 is written in an open source language (Clojure), managed with open source 
tools (Git), and has emphasized unclassified development from inception.  MARATHON 4 
is intentionally written and maintained in such a way as to facilitate sharing and 
discovery, particularly to enable flexible development among remote work locations 
and to enable sharing of code for research purposes, peer-review, external verification,
and publication in professional forums like MORS, WinterSim, and INFORMS.  
MARATHON 4 is, for all intents and purposes, open-source ready and entirely compliant 
with the practices established by the FSCP.  Consequently, MARATHON 4 is an obvious 
open source release candidate, preferably hosted on GitHub.
</p>
</div>
