open-source-whitepaper/modernizing.org
** Practical Benefits of Open Source Via GitHub
- It allows for flexible team-based collaboration. 
  - Developers can work remotely, from home, the office, at odd hours, etc.
    Using Git, we have a rich collaborative platform for managing the source code, enabling
    concurrent, asynchronous development that maximizes development team productivity without
    sacrificing version control.  This complements existing technology like
    Defense Collaboration Services (DCS), allowing teams to communicate in real-time to resolve
    issues, learn about the software architecture, and even modify the source code.  

- There is empirical evidence at CAA of its usefulness/value.
  - CAA has repeatedly maintained a developer shortfall; MARATHON 4 is a shining example of the 
    scarcity of developer talent.  The sole developer (Mr. Spoon) was allowed to continue working 
    remotely because of his decision to maintain MARATHON 4 development in an unclassified format, 
    thus enabling exactly the kind of remote/telework opportunity mentioned above.  
    CAA has been able to avert the loss of critical infrastructure development precisely due to 
    the flexibility enabled by distributed version control, unclassified development, and openness. 

  - With the addition of new team members, leveraging GitHub as a synchronization point has already
    been incredibly useful for distance-based training, collaboration, source code revision, and
    real-time pair-programming.

  - This very document has been collaboratively built and revised on GitHub by CAA personnel.

- It is industry-standard version control.
  - GitHub provides a seamlessly integrated suite of tools that enhance the Git distributed version
    control system (DVCS) developer experience with 
    - source code repository hosting; 
    - web-based interface for examining source code history, diffs, branches, etc.; and
    - web-based issue tracking, team communication, and other collaboration features.

** Compliance with the Federal Source Code Policy
- At a minimum, MARATHON 4 must be shared with other federal agencies.
- Hosting as an open source project, hosted on GitHub, satisfies the existing 
  Federal Source Code Policy, in addition to the spirit of the executive order.
- MARATHON 4 could be used to fulfill the 20% mandate for open-sourcing custom 
  software during the current FSCP pilot program period.

