open-source-whitepaper/modernizing.html

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">9.1</span> Practical Benefits of Open Source Via GitHub</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>It allows for flexible team-based collaboration. 
<ul class="org-ul">
<li>Developers can work remotely, from home, the office, at odd hours, etc.
Using Git, we have a rich collaborative platform for managing the source code, enabling
concurrent, asynchronous development that maximizes development team productivity without
sacrificing version control.  This complements existing technology like
Defense Collaboration Services (DCS), allowing teams to communicate in real-time to resolve
issues, learn about the software architecture, and even modify the source code.</li>
</ul></li>

<li>There is empirical evidence at CAA of its usefulness/value.
<ul class="org-ul">
<li>CAA has repeatedly maintained a developer shortfall; MARATHON 4 is a shining example of the 
scarcity of developer talent.  The sole developer (Mr. Spoon) was allowed to continue working 
remotely because of his decision to maintain MARATHON 4 development in an unclassified format, 
thus enabling exactly the kind of remote/telework opportunity mentioned above.  
CAA has been able to avert the loss of critical infrastructure development precisely due to 
the flexibility enabled by distributed version control, unclassified development, and openness.</li>

<li>With the addition of new team members, leveraging GitHub as a synchronization point has already
been incredibly useful for distance-based training, collaboration, source code revision, and
real-time pair-programming.</li>

<li>This very document has been collaboratively built and revised on GitHub by CAA personnel.</li>
</ul></li>

<li>It is industry-standard version control.
<ul class="org-ul">
<li>GitHub provides a seamlessly integrated suite of tools that enhance the Git distributed version
control system (DVCS) developer experience with 
<ul class="org-ul">
<li>source code repository hosting;</li>
<li>web-based interface for examining source code history, diffs, branches, etc.; and</li>
<li>web-based issue tracking, team communication, and other collaboration features.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">9.2</span> Compliance with the Federal Source Code Policy</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>At a minimum, MARATHON 4 must be shared with other federal agencies.</li>
<li>Hosting as an open source project, hosted on GitHub, satisfies the existing 
Federal Source Code Policy, in addition to the spirit of the executive order.</li>
<li>MARATHON 4 could be used to fulfill the 20% mandate for open-sourcing custom 
software during the current FSCP pilot program period.</li>
</ul>
</div>
</div>
</div>
