open-source-whitepaper/modernizing.html

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">10</span> Possible Objections and Risks</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>&ldquo;Army Policy Prevents Us From Doing So&rdquo; 
<ul class="org-ul">
<li>The AMSO guidance in AR 5-11 contradicts (or in the best case, is ignorant of) 
the Federal Source Code Policy.  The apparent reflexive response to &ldquo;not share&rdquo; with federal 
agencies, and  international partners, is contrary to both the spirit and the policy 
codified by EO 13642 and OMB M-16-21.</li>
</ul></li>

<li>&ldquo;We should protect Army / CAA interests by not sharing source code.&rdquo;
<ul class="org-ul">
<li>The numerous benefits delineated by the DoD/CIO-G6, as well as decades of 
empirical confirmation that &ldquo;sharing is beneficial&rdquo; from the software 
industry and academia support an alternate prospect: CAA would be 
protecting CAA / Army interests by taking advantage of the massive 
benefits of open source collaboration, and by complying with policy set forth by the 
Executive Office of the President of the United States.</li>
</ul></li>

<li>&ldquo;We should run the model, they don&rsquo;t need the source. They can ask us for the analysis.&rdquo;
<ul class="org-ul">
<li>This service-minded aspect of Army M&amp;S is detailed in AR 5-11 and is the predominant 
&ldquo;business model&rdquo; that CAA and many analytic agencies follow.  Sharing code does not 
equate to sharing expertise.  Indeed, the dominant open source software business 
model is to provide support and service in exchange for remuneration.  Many clients 
or sponsors simply lack the developer talent or inclination to modify the source 
code, and will still be interested in the services provided.  The legacy 
service-based model can &#x2014; and will &#x2014; survive, with the added benefit of collaboration 
and possible community engagement.</li>
</ul></li>

<li>&ldquo;We&rsquo;d expose ourselves to security vulnerability.&rdquo;
<ul class="org-ul">
<li>MARATHON 4 is not a national security system, as defined by 44 U.S. Code § 3542.
MARATHON 4 is merely an instantiation of AR 525-29, a publicly available document 
detailing Army Force Generation.  Started as a purely unclassified development 
effort, MARATHON 4 maintains that the source code for the simulation &#x2014; including 
comments, notional test data, and related documentation &#x2014; neither requires nor 
includes classified information.  Rather, only the data upon which MARATHON 4 is 
applied, and the resulting analysis, if performed on a secure network with
classified input, would be classified.</li>

<li><p>
The security benefits of sharing and open sourcing are well-known, even 
within DoD and the Army.  
Per the (DoD-CIO/G6 OSS FAQ, &ldquo;Q: Doesn&rsquo;t hiding source code automatically make
software more secure?&rdquo;):
</p>
<blockquote>
<p>
Even when the original source is necessary for in-depth analysis, making source
code available to the public significantly aids defenders and not just attackers. 
Continuous and broad peer-review, enabled by publicly available source code, 
improves software reliability and security through the identification and 
elimination of defects that might otherwise go unrecognized by the core development
team.
</p>

<p>
Conversely, where source code is hidden from the public, attackers can attack the 
software anyway as described above.  In addition, an attacker can often acquire the
original source code from suppliers anyway (either because the supplier voluntarily
provides it or via attacks against the supplier). In such cases where only the 
attacker has the source code, the attacker ends up with another advantage. 
</p>

<p>
Hiding source code does inhibit the ability of third parties to respond to 
vulnerabilities (because changing software is more difficult without the 
source code), but this is obviously not a security advantage. 
In general, &ldquo;Security by Obscurity&rdquo; is widely denigrated.
</p>
</blockquote></li>

<li><p>
The Office of the Secretary of Defense recently piloted a
successful program, called &ldquo;Hack the Pentagon&rdquo;, to harden Pentagon
defenses by engaging the broader community of (third party)
security experts to test DoD software systems and services at the
Pentagon.  The DoD News article &ldquo;DoD Announces ‘Hack the Pentagon’
Follow-Up Initiative&rdquo; outlines the results:
</p>
<blockquote>
<p>
&#x2026; the pilot program &#x2026; allowed more than 1,400 registered
hackers to test the defenses of select open source DoD websites
such as Defense.gov.  Hackers who identified security gaps that
qualified as valid vulnerabilities were then rewarded with a
corresponding bounty price.  As a result of this pilot, 138
unique and previously undisclosed vulnerabilities were
identified by security researchers and remediated in near
real-time by the Defense Media Activity.
</p>
</blockquote></li>
</ul></li>

<li>&ldquo;We have no obligation to release if no-one asks.&rdquo;
<ul class="org-ul">
<li>The Federal Source Code Policy mandates that our non-exempt software, like MARATHON 4, is &#x2014; at 
a minimum &#x2014; advertised via <a href="https://code.gov">https://code.gov</a> and accessible to other federal agencies for reuse.</li>
<li>The Federal Source Code Policy mandates that 20% of created or acquired custom 
software must be released as open source during the current pilot program, which lasts 
until 2019.</li>
</ul></li>

<li>&ldquo;Contractors will just repackage it and sell it back to us.&rdquo; 
<ul class="org-ul">
<li>If a contractor  uses the source code to make something even marginally better, 
then under the EO and OMB guidance we (the federal government) actually should get their
modifications back in full. Other agencies devoting resources to improve MARATHON 4,
with CAA controlling the integration and  merging of improvements, serves to extend the 
range of support for MARATHON 4 development, further helping the chronic developer capability
gap at CAA.</li>
</ul></li>
<li>&ldquo;CAA will be legally liable for support and any problems users encounter if we open source.&rdquo;
<ul class="org-ul">
<li>The default open source posture provided by the FSCP, and DoD/CIO-G6, precludes this possibility.
Where applicable, open source licenses vetted by DCS/CIO-G6, specifically indemnify the original
author of the code and provision no warranty for fitness of use or guarantee of support.</li>
</ul></li>
</ul>
</div>
</div>
