open-source-whitepaper/modernizing.org
* Desired End State
Ideally, CAA will join the ranks of other Federal agencies and embrace the general modernization
of government technology, specifically the realization of the benefits of Open Source Software 
development and sharing source code. The tendency to reflexively lock down source code without 
assessing the benefits --- let alone the current mandate --- to share our knowledge across the 
government and the public domain, serves to ensure isolated, resource-constrained development
devoid of the known value of external collaboration.  In pursuance of modernizing the Army 
technology space and in accordance with the Federal Source Code Policy, CAA and AMSO should 
lead this effort from the front.

In an ideal world, the benefits of sharing source code and allowing for interoperability with other agencies 
(even individuals like college students, researchers, or industry professionals) can pay dividends
in improving the source, aiding in verification, and generally building a community of interest. 

Access to the source code does not imply knowledge of how to build, execute, modify, or extend the 
model; nor does access engender an innate desire to do so.  The established model-as-service 
approach still works under the open source paradigm.

MARATHON 4 can directly benefit from open development and hosting on GitHub by taking advantage of 
the open source paradigm under the auspices of the governing Federal Source Code Policy.  

* Recommendations
1) CAA should comply with the Federal Source Code Policy.
   - CAA should provision the sharing of source code with federal agencies, and 
     advertise repositories on code.gov and / or code.mil as appropriate.
   - CAA should comply with the provisions of the pilot program from M-16-21, that 
     20% of newly-created (or acquired) custom software must be released as open source.
2) AR 5-11 "Management of Army Modeling and Simulation, 30 May 2014" should be made consistent with the Federal Source Code Policy.
   - AR 5-11 does not account for the paradigm shift toward Open Source Software development and hence
     is now incongruous with the governing orders regarding the Federal Source Code Policy.
3) MARATHON 4 should be hosted on GitHub to enable collaborative team development.
   - CAA should actively leverage modern technology (GitHub and DVCS) to address 
     the long-standing MARATHON developer capability gap.
   - Until CAA refines its position on compliance with the Federal Source Code Policy, 
     MARATHON should be maintained as a private repository on GitHub to enable 
     rapid development and verification in the near-term.
     - Private GitHub repositories are available, but require additional 
       $25/month funding to support 5 developers for an organization. 
     - Should CAA decide to openly develop MARATHON, GitHub hosting is 
       free for public repositories.
4) CAA should follow the example set by US Army Research Laboratories and 
   release MARATHON 4 into the open as public domain software.
  - The U.S. Government has no copyright or intellectual property claim to MARATHON 4 or 
    any taxpayer-funded creative work.
  - MARATHON does not meet the exceptions provided by the Federal Source Code Policy, 
    namely the legal, classification, or national security system (44 USC 3542) exceptions.
  - Open development can only serve to strengthen the quality of MARATHON 4 by 
    easing collaboration and community engagement, while fulfilling the 
    Federal Source Code Policy mandate for the Open Source Software Pilot Program, 
    and establishing CAA as a leader in modern federal Open Source Software development.
    
* References	

#+LATEX: \begin{footnotesize}

- Code.gov: https://code.gov

- Code.mil: https://code.mil

  - This is run by Defense Digital Service of the US Digital Service.

  - Defense Digital Service: https://www.dds.mil

  - US Digital Service: https://www.usds.gov

- AR 5-11 (Management of Army Modeling and Simulation, 30 May 2014)	

  http://www.apd.army.mil/epubs/DR_pubs/DR_a/pdf/web/r5_11.pdf	

- AR 25-1 (Army Information Technology, 25 June 2013)	

  http://www.apd.army.mil/epubs/DR_pubs/DR_a/pdf/web/r25_1.pdf	

- DoD-CIO/G6 (Clarification Guidance Regarding Open Source Software (OSS), 16 October 2009)	

  http://dodcio.defense.gov/Portals/0/Documents/FOSS/2009OSS.pdf	

- DoD-CIO/G6 (Open Source Software FAQ)	

  http://dodcio.defense.gov/Open-Source-Software-FAQ/	

- Federal Source Code Policy Memorandum	

  https://obamawhitehouse.archives.gov/sites/default/files/omb/memoranda/2016/m_16_21.pdf

  https://sourcecode.cio.gov

  https://sourcecode.cio.gov/Exceptions

- Executive Order 13642, May 9, 2013	
  "Making Open and Machine Readable the New Default for Government Information"	

  https://www.gpo.gov/fdsys/pkg/DCPD-201300318/pdf/DCPD-201300318.pdf

  #+LATEX: \iffalse
  https://obamawhitehouse.archives.gov/the-press-office/2013/05/09/executive-order-making-open-and-machine-readable-new-default-government-
  #+LATEX: \fi

  - Initial guidance for the Federal Source Code Policy

- Obama's Digital Government Initiative

  https://obamawhitehouse.archives.gov/sites/default/files/omb/egov/digital-government/digital-government.html

  https://obamawhitehouse.archives.gov/blog/2016/08/08/peoples-code

- Definition of "national security system" from "44 U.S. Code § 3542 - Definitions"

  https://www.law.cornell.edu/uscode/text/44/3542

  - This term shows up in the Federal Source Code Policy Memorandum (esp. in section "Exceptions")

- Hack the Pentagon Results, "DoD Announces Hack the Pentagon Follow-up Initiative"

  https://www.defense.gov/News/Article/Article/981160/dod-announces-hack-the-pentagon-follow-up-initiative

#+LATEX: \end{footnotesize}
