open-source-whitepaper/modernizing.html

<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">11</span> Desired End State</h2>
<div class="outline-text-2" id="text-11">
<p>
Ideally, CAA will join the ranks of other Federal agencies and embrace the general modernization
of government technology, specifically the realization of the benefits of Open Source Software 
development and sharing source code. The tendency to reflexively lock down source code without 
assessing the benefits &#x2014; let alone the current mandate &#x2014; to share our knowledge across the 
government and the public domain, serves to ensure isolated, resource-constrained development
devoid of the known value of external collaboration.  In pursuance of modernizing the Army 
technology space and in accordance with the Federal Source Code Policy, CAA and AMSO should 
lead this effort from the front.
</p>

<p>
In an ideal world, the benefits of sharing source code and allowing for interoperability with other agencies 
(even individuals like college students, researchers, or industry professionals) can pay dividends
in improving the source, aiding in verification, and generally building a community of interest. 
</p>

<p>
Access to the source code does not imply knowledge of how to build, execute, modify, or extend the 
model; nor does access engender an innate desire to do so.  The established model-as-service 
approach still works under the open source paradigm.
</p>

<p>
MARATHON 4 can directly benefit from open development and hosting on GitHub by taking advantage of 
the open source paradigm under the auspices of the governing Federal Source Code Policy.  
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">12</span> Recommendations</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>CAA should comply with the Federal Source Code Policy.
<ul class="org-ul">
<li>CAA should provision the sharing of source code with federal agencies, and 
advertise repositories on code.gov and / or code.mil as appropriate.</li>
<li>CAA should comply with the provisions of the pilot program from M-16-21, that 
20% of newly-created (or acquired) custom software must be released as open source.</li>
</ul></li>
<li>AR 5-11 &ldquo;Management of Army Modeling and Simulation, 30 May 2014&rdquo; should be made consistent with the Federal Source Code Policy.
<ul class="org-ul">
<li>AR 5-11 does not account for the paradigm shift toward Open Source Software development and hence
is now incongruous with the governing orders regarding the Federal Source Code Policy.</li>
</ul></li>
<li>MARATHON 4 should be hosted on GitHub to enable collaborative team development.
<ul class="org-ul">
<li>CAA should actively leverage modern technology (GitHub and DVCS) to address 
the long-standing MARATHON developer capability gap.</li>
<li>Until CAA refines its position on compliance with the Federal Source Code Policy, 
MARATHON should be maintained as a private repository on GitHub to enable 
rapid development and verification in the near-term.
<ul class="org-ul">
<li>Private GitHub repositories are available, but require additional 
$25/month funding to support 5 developers for an organization.</li>
<li>Should CAA decide to openly develop MARATHON, GitHub hosting is 
free for public repositories.</li>
</ul></li>
</ul></li>
<li>CAA should follow the example set by US Army Research Laboratories and 
release MARATHON 4 into the open as public domain software.
<ul class="org-ul">
<li>The U.S. Government has no copyright or intellectual property claim to MARATHON 4 or 
any taxpayer-funded creative work.</li>
<li>MARATHON does not meet the exceptions provided by the Federal Source Code Policy, 
namely the legal, classification, or national security system (44 USC 3542) exceptions.</li>
<li>Open development can only serve to strengthen the quality of MARATHON 4 by 
easing collaboration and community engagement, while fulfilling the 
Federal Source Code Policy mandate for the Open Source Software Pilot Program, 
and establishing CAA as a leader in modern federal Open Source Software development.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22"><span class="section-number-2">13</span> References</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>Code.gov: <a href="https://code.gov">https://code.gov</a></li>

<li>Code.mil: <a href="https://code.mil">https://code.mil</a>

<ul class="org-ul">
<li>This is run by Defense Digital Service of the US Digital Service.</li>

<li>Defense Digital Service: <a href="https://www.dds.mil">https://www.dds.mil</a></li>

<li>US Digital Service: <a href="https://www.usds.gov">https://www.usds.gov</a></li>
</ul></li>

<li><p>
AR 5-11 (Management of Army Modeling and Simulation, 30 May 2014)        
</p>

<p>
<a href="http://www.apd.army.mil/epubs/DR_pubs/DR_a/pdf/web/r5_11.pdf">http://www.apd.army.mil/epubs/DR_pubs/DR_a/pdf/web/r5_11.pdf</a> 
</p></li>

<li><p>
AR 25-1 (Army Information Technology, 25 June 2013)        
</p>

<p>
<a href="http://www.apd.army.mil/epubs/DR_pubs/DR_a/pdf/web/r25_1.pdf">http://www.apd.army.mil/epubs/DR_pubs/DR_a/pdf/web/r25_1.pdf</a> 
</p></li>

<li><p>
DoD-CIO/G6 (Clarification Guidance Regarding Open Source Software (OSS), 16 October 2009)        
</p>

<p>
<a href="http://dodcio.defense.gov/Portals/0/Documents/FOSS/2009OSS.pdf">http://dodcio.defense.gov/Portals/0/Documents/FOSS/2009OSS.pdf</a> 
</p></li>

<li><p>
DoD-CIO/G6 (Open Source Software FAQ)        
</p>

<p>
<a href="http://dodcio.defense.gov/Open-Source-Software-FAQ/">http://dodcio.defense.gov/Open-Source-Software-FAQ/</a> 
</p></li>

<li><p>
Federal Source Code Policy Memorandum        
</p>

<p>
<a href="https://obamawhitehouse.archives.gov/sites/default/files/omb/memoranda/2016/m_16_21.pdf">https://obamawhitehouse.archives.gov/sites/default/files/omb/memoranda/2016/m_16_21.pdf</a>
</p>

<p>
<a href="https://sourcecode.cio.gov">https://sourcecode.cio.gov</a>
</p>

<p>
<a href="https://sourcecode.cio.gov/Exceptions">https://sourcecode.cio.gov/Exceptions</a>
</p></li>

<li><p>
Executive Order 13642, May 9, 2013        
&ldquo;Making Open and Machine Readable the New Default for Government Information&rdquo;        
</p>

<p>
<a href="https://www.gpo.gov/fdsys/pkg/DCPD-201300318/pdf/DCPD-201300318.pdf">https://www.gpo.gov/fdsys/pkg/DCPD-201300318/pdf/DCPD-201300318.pdf</a>
</p>

<p>
<a href="https://obamawhitehouse.archives.gov/the-press-office/2013/05/09/executive-order-making-open-and-machine-readable-new-default-government">https://obamawhitehouse.archives.gov/the-press-office/2013/05/09/executive-order-making-open-and-machine-readable-new-default-government</a>-
</p>
<ul class="org-ul">
<li>Initial guidance for the Federal Source Code Policy</li>
</ul></li>

<li><p>
Obama&rsquo;s Digital Government Initiative
</p>

<p>
<a href="https://obamawhitehouse.archives.gov/sites/default/files/omb/egov/digital-government/digital-government.html">https://obamawhitehouse.archives.gov/sites/default/files/omb/egov/digital-government/digital-government.html</a>
</p>

<p>
<a href="https://obamawhitehouse.archives.gov/blog/2016/08/08/peoples-code">https://obamawhitehouse.archives.gov/blog/2016/08/08/peoples-code</a>
</p></li>

<li><p>
Definition of &ldquo;national security system&rdquo; from &ldquo;44 U.S. Code § 3542 - Definitions&rdquo;
</p>

<p>
<a href="https://www.law.cornell.edu/uscode/text/44/3542">https://www.law.cornell.edu/uscode/text/44/3542</a>
</p>

<ul class="org-ul">
<li>This term shows up in the Federal Source Code Policy Memorandum (esp. in section &ldquo;Exceptions&rdquo;)</li>
</ul></li>

<li><p>
Hack the Pentagon Results, &ldquo;DoD Announces Hack the Pentagon Follow-up Initiative&rdquo;
</p>

<p>
<a href="https://www.defense.gov/News/Article/Article/981160/dod-announces-hack-the-pentagon-follow-up-initiative">https://www.defense.gov/News/Article/Article/981160/dod-announces-hack-the-pentagon-follow-up-initiative</a>
</p></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 3 March 2017</p>
<p class="author">Author: Tom Spoon, Rick Hanson and Craig Flewelling</p>
<p class="date">Created: 2017-03-05 Sun 16:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
